cfg/DataProcessors/АдреснаяКнига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АдреснаяКнига</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбщегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытаДляВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытиеПриВыборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодборОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Кому</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Копии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкрытыеКопии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/DataProcessors/АдреснаяКнига/Forms/ФормаПодбора/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура активизирует переданный объект на левой строне формы
//
Процедура АктивизироватьОбъект(ОбъектАктивизации) 
	
	Если НЕ ЗначениеЗаполнено(ОбъектАктивизации) Тогда
		Возврат
	КонецЕсли;

	ТипЗначенияОбъекта = ТипЗнч(ОбъектАктивизации);
	
	Если ТипЗначенияОбъекта = Тип("СправочникСсылка.ФизическиеЛица") Тогда
 		ЭлементыФормы.ОбщаяПанель.ТекущаяСтраница = ЭлементыФормы.ОбщаяПанель.Страницы["ФизическиеЛица"];
		ЭлементыФормы.ФизЛицаСписок.ТекущаяСтрока = ОбъектАктивизации;
	ИначеЕсли ТипЗначенияОбъекта = Тип("СправочникСсылка.Организации") Тогда
 		ЭлементыФормы.ОбщаяПанель.ТекущаяСтраница = ЭлементыФормы.ОбщаяПанель.Страницы["Организации"];
		ЭлементыФормы.ОрганизацииСписок.ТекущаяСтрока = ОбъектАктивизации;
	ИначеЕсли ТипЗначенияОбъекта = Тип("СправочникСсылка.Пользователи") Тогда
 		ЭлементыФормы.ОбщаяПанель.ТекущаяСтраница = ЭлементыФормы.ОбщаяПанель.Страницы["Пользователи"];
		ЭлементыФормы.ПользователиСписок.ТекущаяСтрока = ОбъектАктивизации;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии()
	
	Объект_ПриОткрытии(ЭлементыФормы);
	
	ИмяТекущейСтраницы = ВосстановитьЗначение("ИмяТекущейСтраницыПодбор");
	Если ТипЗнч(ИмяТекущейСтраницы) = Тип("Строка") Тогда
		Попытка
			ЭлементыФормы.ОбщаяПанель.ТекущаяСтраница = ЭлементыФормы.ОбщаяПанель.Страницы[ИмяТекущейСтраницы];
		Исключение
		КонецПопытки;
	КонецЕсли; 
	
    ОбъектАктивизации = Неопределено;
	Если ЭлементыФормы.ПанельКому.ТекущаяСтраница.Имя = "Кому" Тогда
		Если ЭтаФорма.Кому.Количество()>0 Тогда
			ОбъектАктивизации = ЭтаФорма.Кому[0].Объект;
		КонецЕсли;
	ИначеЕсли ЭлементыФормы.ПанельКому.ТекущаяСтраница.Имя = "Копии" Тогда
		Если ЭтаФорма.Копии.Количество()>0 Тогда
			ОбъектАктивизации = ЭтаФорма.Копии[0].Объект;
		КонецЕсли;
	ИначеЕсли ЭлементыФормы.ПанельКому.ТекущаяСтраница.Имя = "СкрытыеКопии" Тогда
		Если ЭтаФорма.СкрытыеКопии.Количество()>0 Тогда
			ОбъектАктивизации = ЭтаФорма.СкрытыеКопии[0].Объект;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектАктивизации) Тогда
		АктивизироватьОбъект(ОбъектАктивизации);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПриЗакрытии формы.
//
Процедура ПриЗакрытии()
	
	СохранитьЗначение("ВидОбщегоОбъекта"        , ВидОбщегоОбъекта);
	СохранитьЗначение("ИмяТекущейСтраницыПодбор", ЭлементыФормы.ОбщаяПанель.ТекущаяСтраница.Имя);
	
КонецПроцедуры

// Обработчик события ОбновлениеОтображения формы.
//
Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.ПанельКому.Страницы.Кому.Заголовок         = НСтр("ru='Кому (';uk='Кому ('") + Кому.Количество() + ")";
	ЭлементыФормы.ПанельКому.Страницы.Копии.Заголовок        = НСтр("ru='Копии (';uk='Копії ('") + Копии.Количество() + ")";
	ЭлементыФормы.ПанельКому.Страницы.СкрытыеКопии.Заголовок = НСтр("ru='Скрытые копии (';uk='Приховані копії ('") + СкрытыеКопии.Количество() + ")";
	ЭлементыФормы.ПанельКому.Страницы.Объекты.Заголовок      = НСтр("ru='Элементы (';uk='Елементи ('") + Объекты.Количество() + ")";
	
КонецПроцедуры

// Обработчик события ОбработкаЗаписиНовогоОбъекта формы.
//
Процедура ОбработкаЗаписиНовогоОбъекта(Объект, Источник)
	
	Объект_ОбработкаЗаписиНовогоОбъекта(Объект, Источник, ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛИ ФОРМЫ

// Обработчик события Нажатие командной панели формы ОсновныеДействияФормы.Выполнить.
//
Процедура КнопкаВыполнитьНажатие(Элемент)
	
	Объект_КнопкаВыполнитьНажатие(Элемент, ЭтаФорма);
	
КонецПроцедуры

// Обработчик события Нажатие командной панели формы КоманднаяПанельРезультатыПоиска.АдресЭлектроннойПочтыВНовыйОбъект.
//
Процедура КоманднаяПанельРезультатыПоискаАдресЭлектроннойПочтыВНовыйОбъект(Кнопка)
	
	СоздатьНовыйОбъектСАдресомЭлектроннойПочты(СтрокаПоиска);
	
КонецПроцедуры

// Обработчик события Нажатие командной панели формы КоманднаяПанельРезультатыПоиска.АдресЭлектроннойПочтыВОбъектТекущейСтроки.
//
Процедура КоманднаяПанельРезультатыПоискаАдресЭлектроннойПочтыВОбъектТекущейСтроки(Кнопка)
	
	Если ЭлементыФормы.РезультатыПоиска.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ЭлементыФормы.РезультатыПоиска.ТекущиеДанные.Объект) Тогда
		ДобавитьАдресЭлектроннойПочтыВОбъект(СтрокаПоиска, ЭлементыФормы.РезультатыПоиска.ТекущиеДанные.Объект);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события Нажатие командной панели формы КоманднаяПанельГруппыОбъектов.Обновить.
//
Процедура КоманднаяПанельГруппыОбъектовОбновить(Кнопка)
	
	ЗаполнитьСписокГруппРассылки(ГруппыРассылкиСписок);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ПОЛЕЙ ФОРМЫ

// Обработчик события ПриАктивизацииСтроки элемента формы ФизЛицаСписок.
//
Процедура ФизЛицаСписокПриАктивизацииСтроки(Элемент)
    
    ПодключитьОбработчикОжидания("ОбработчикОжиданияФизЛицаСписокПриАктивизацииСтроки", 0.1, Истина);	 	
	
КонецПроцедуры

// Процедура - обрабочик ожидания для события ПриАктивизацииСтроки
// табличного поля ФизЛицаСписок
//
Процедура ОбработчикОжиданияФизЛицаСписокПриАктивизацииСтроки()
    
    ПолучитьАдресЭлектроннойПочты(ЭлементыФормы.ФизЛицаСписок, ЭлементыФормы.АдресФизЛица, СписокДанныхТекущейСтроки);
    
КонецПроцедуры // ОбработчикОжиданияФизЛицаСписокПриАктивизацииСтроки

 
// Обработчик события ПриАктивизацииСтроки элемента формы ОрганизацииСписок.
//
Процедура ОрганизацииСписокПриАктивизацииСтроки(Элемент)
    
    ПодключитьОбработчикОжидания("ОбработчикОжиданияОрганизацииСписокПриАктивизацииСтроки", 0.1, Истина);	 	
	
КонецПроцедуры

// Процедура - обрабочик ожидания для события ПриАктивизацииСтроки
// табличного поля ОрганизацииСписок
//
Процедура ОбработчикОжиданияОрганизацииСписокПриАктивизацииСтроки()
    
    ПолучитьАдресЭлектроннойПочты(ЭлементыФормы.ОрганизацииСписок, ЭлементыФормы.АдресОрганизации, СписокДанныхТекущейСтроки);
    
КонецПроцедуры // ОбработчикОжиданияОрганизацииСписокПриАктивизацииСтроки

 

// Обработчик события ПриАктивизацииСтроки элемента формы ПользователиСписок.
//
Процедура ПользователиСписокПриАктивизацииСтроки(Элемент)
	
    ПодключитьОбработчикОжидания("ОбработчикОжиданияПользователиСписокПриАктивизацииСтроки", 0.1, Истина);	 
	
КонецПроцедуры

// Процедура - обрабочик ожидания для события ПриАктивизацииСтроки
// табличного поля ПользователиСписок
//
Процедура ОбработчикОжиданияПользователиСписокПриАктивизацииСтроки()
    
    ПолучитьАдресЭлектроннойПочты(ЭлементыФормы.ПользователиСписок, ЭлементыФормы.АдресПользователи, СписокДанныхТекущейСтроки);
        
КонецПроцедуры // ОбработчикОжиданияПользователиСписокПриАктивизацииСтроки

 
// Обработчик события ПриАктивизацииСтроки элемента формы РезультатыПоиска.
//
Процедура РезультатыПоискаПриАктивизацииСтроки(Элемент)
	
    ПодключитьОбработчикОжидания("ОбработчикОжиданияРезультатыПоискаПриАктивизацииСтроки", 0.1, Истина);	 
	
КонецПроцедуры

// Процедура - обрабочик ожидания для события ПриАктивизацииСтроки
// табличного поля РезультатыПоиска
//
Процедура ОбработчикОжиданияРезультатыПоискаПриАктивизацииСтроки()
    
    Объект_РезультатыПоискаПриАктивизацииСтроки(ЭлементыФормы.РезультатыПоиска, ЭлементыФормы);
    
КонецПроцедуры // ОбработчикОжиданияРезультатыПоискаПриАктивизацииСтроки

 

// Обработчик события НачалоВыбораИзСписка элемента формы Кому.АдресЭлектроннойПочты.
//
Процедура КомуАдресЭлектроннойПочтыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Объект_АдресЭлектроннойПочтыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка, ЭлементыФормы.Кому, ЭтаФорма);
	
КонецПроцедуры

// Обработчик события ПриИзменении элемента формы Кому.Объект.
//
Процедура КомуОбъектПриИзменении(Элемент)
	
	Объект_ОбъектЭлектроннойПочтыПриИзменении(Элемент, ЭлементыФормы.Кому);
	
КонецПроцедуры

// Обработчик события НачалоВыбораИзСписка элемента формы Копии.АдресЭлектроннойПочты.
//
Процедура КопииАдресЭлектроннойПочтыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Объект_АдресЭлектроннойПочтыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка, ЭлементыФормы.Копии, ЭтаФорма);
	
КонецПроцедуры

// Обработчик события ПриИзменении элемента формы Копии.Объект.
//
Процедура КопииОбъектПриИзменении(Элемент)
	
	Объект_ОбъектЭлектроннойПочтыПриИзменении(Элемент, ЭлементыФормы.Копии);
	
КонецПроцедуры

// Обработчик события НачалоВыбораИзСписка элемента формы СкрытыеКопии.АдресЭлектроннойПочты.
//
Процедура СкрытыеКопииАдресЭлектроннойПочтыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Объект_АдресЭлектроннойПочтыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка, ЭлементыФормы.СкрытыеКопии, ЭтаФорма);
	
КонецПроцедуры

// Обработчик события ПриИзменении элемента формы СкрытыеКопии.Объект.
//
Процедура СкрытыеКопииОбъектПриИзменении(Элемент)
	
	Объект_ОбъектЭлектроннойПочтыПриИзменении(Элемент, ЭлементыФормы.СкрытыеКопии);
	
КонецПроцедуры


// Обработчик события ПередНачаломИзменения элемента формы Объекты.
//
Процедура ОбъектыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Объект) Тогда
		ОткрытьФормуОбъекта(Элемент.ТекущиеДанные.Объект);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события ПередНачаломИзменения элемента формы РезультатыПоиска.
//
Процедура РезультатыПоискаПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Объект) Тогда
		ОткрытьФормуОбъекта(Элемент.ТекущиеДанные.Объект);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события Выбор элемента формы ФизЛицаСписок.
//
Процедура ФизЛицаСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если НЕ (Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.ЭтоГруппа) Тогда
		СтандартнаяОбработка = Ложь;
		ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ФизЛицаСписок, ЭлементыФормы.АдресФизЛица, СтандартнаяОбработка, "ФизическиеЛица");
		ОбработкаВыбораТабличныхПолей(ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры


// Обработчик события Выбор элемента формы ОрганизацииСписок.
//
Процедура ОрганизацииСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ОрганизацииСписок, ЭлементыФормы.АдресОрганизации, СтандартнаяОбработка, "Организации");
		ОбработкаВыбораТабличныхПолей(ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры


// Обработчик события Выбор элемента формы ПользователиСписок.
//
Процедура ПользователиСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если НЕ (Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.ЭтоГруппа) Тогда
		СтандартнаяОбработка = Ложь;
		ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ПользователиСписок, ЭлементыФормы.АдресПользователи, СтандартнаяОбработка, "Пользователи");
		ОбработкаВыбораТабличныхПолей(ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события Выбор элемента формы РезультатыПоиска.
//
Процедура РезультатыПоискаВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если НЕ (Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.Объект.ЭтоГруппа) Тогда
		СтандартнаяОбработка = Ложь;
		ДобавитьЭлементыРезультатовПоиска(ЭлементыФормы, РезультатыПоиска);
		ОбработкаВыбораТабличныхПолей(ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события Выбор элемента формы ГруппыРассылкиСписок.
//
Процедура ГруппыРассылкиСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если НЕ (ОткрытаДляВыбора И ОткрытиеПриВыборе) Тогда
			СтандартнаяОбработка = Ложь;
			ДобавитьЭлементыГруппРассылки(ЭлементыФормы, ГруппыРассылкиСписок);
			ОбработкаВыбораТабличныхПолей(ЭтаФорма);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры


// Обработчик события ПередУдалением элемента формы РезультатыПоиска.
//
Процедура РезультатыПоискаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события ПередНачаломДобавления элемента формы РезультатыПоиска.
//
Процедура РезультатыПоискаПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события ПриВыводеСтроки элемента формы ГруппыРассылкиСписок.
//
Процедура ГруппыРассылкиСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Объект_ГруппыРассылкиСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки);
	
КонецПроцедуры

// Обработчик события ПередНачаломДобавления элемента формы ГруппыРассылкиСписок.
//
Процедура ГруппыРассылкиСписокПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Объект_ГруппыРассылкиСписокПередНачаломДобавления(Элемент, Отказ, Копирование, ЭтаФорма);
	
КонецПроцедуры

// Обработчик события ПередНачаломИзменения элемента формы ГруппыРассылкиСписок.
//
Процедура ГруппыРассылкиСписокПередНачаломИзменения(Элемент, Отказ)
	
	Объект_ГруппыРассылкиСписокПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);
	
КонецПроцедуры

// Обработчик события ПередУдалением элемента формы ГруппыРассылкиСписок.
//
Процедура ГруппыРассылкиСписокПередУдалением(Элемент, Отказ)
	
	Объект_ГруппыРассылкиСписокПередУдалением(Элемент, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КНОПОК ФОРМЫ


// Обработчик события Нажатие элемента формы КнопкаДобавитьФизЛица.
//
Процедура КнопкаДобавитьФизЛицаНажатие(Элемент)
	
	ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ФизЛицаСписок, ЭлементыФормы.АдресФизЛица, , "ФизическиеЛица");
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьФизЛицаВсе.
//
Процедура КнопкаДобавитьФизЛицаВсеНажатие(Элемент)
	
	ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ФизЛицаСписок, ЭлементыФормы.АдресФизЛица, , "ФизическиеЛица", Истина);
	
КонецПроцедуры


// Обработчик события Нажатие элемента формы КнопкаДобавитьОрганизации.
//
Процедура КнопкаДобавитьОрганизацииНажатие(Элемент)
	
	ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ОрганизацииСписок, ЭлементыФормы.АдресОрганизации, , "Организации");
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьОрганизацииВсе.
//
Процедура КнопкаДобавитьОрганизацииВсеНажатие(Элемент)
	
	ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ОрганизацииСписок, ЭлементыФормы.АдресОрганизации, , "Организации", Истина);
	
КонецПроцедуры


// Обработчик события Нажатие элемента формы КнопкаДобавитьПользователи.
//
Процедура КнопкаДобавитьПользователиНажатие(Элемент)
	
	ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ПользователиСписок, ЭлементыФормы.АдресПользователи, , "Пользователи");
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьПользователиВсе.
//
Процедура КнопкаДобавитьПользователиВсеНажатие(Элемент)
	
	ДобавитьЭлементы(ЭлементыФормы, СписокДанныхТекущейСтроки, ЭлементыФормы.ПользователиСписок, ЭлементыФормы.АдресПользователи, , "Пользователи", Истина);
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьГруппыОбъектов.
//
Процедура КнопкаДобавитьГруппыОбъектовНажатие(Элемент)
	
	ДобавитьЭлементыГруппРассылки(ЭлементыФормы, ГруппыРассылкиСписок);
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьГруппыОбъектовВсе.
//
Процедура КнопкаДобавитьГруппыОбъектовВсеНажатие(Элемент)
	
	ДобавитьЭлементыГруппРассылки(ЭлементыФормы, ГруппыРассылкиСписок, Истина);
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьПоиск.
//
Процедура КнопкаДобавитьПоискНажатие(Элемент)
	
	ДобавитьЭлементыРезультатовПоиска(ЭлементыФормы, РезультатыПоиска);
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьПоискВсе.
//
Процедура КнопкаДобавитьПоискВсеНажатие(Элемент)
	
	ДобавитьЭлементыРезультатовПоиска(ЭлементыФормы, РезультатыПоиска, Истина);
	
КонецПроцедуры


// Обработчик события Нажатие элемента формы КнопкаУдалитьВсе.
//
Процедура КнопкаУдалитьВсеНажатие(Элемент)
	
	ОтветНаВопрос = Вопрос(НСтр("ru='Очистить информацию на закладках ""Кому"", ""Копии"" и ""Скрытые копии"" ?';uk='Очистити інформацію на закладках ""Кому"", ""Копії"" і ""Приховані копії"" ?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветНаВопрос <> КодВозвратаДиалога.Да  Тогда
		Возврат;
	КонецЕсли;
	
	Кому.Очистить();
	Копии.Очистить();
	СкрытыеКопии.Очистить();
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаУдалитьКому.
//
Процедура КнопкаУдалитьКомуНажатие(Элемент)
	
	Если ЭлементыФормы.Кому.ТекущиеДанные <> Неопределено Тогда
		Кому.Удалить(ЭлементыФормы.Кому.ТекущиеДанные);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаУдалитьКомуВсе.
//
Процедура КнопкаУдалитьКомуВсеНажатие(Элемент)
	
	ОтветНаВопрос = Вопрос(НСтр("ru='Очистить информацию на закладке ""Кому"" ?';uk='Очистити інформацію на закладці ""Кому"" ?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветНаВопрос <> КодВозвратаДиалога.Да  Тогда
		Возврат;
	КонецЕсли;
	
	Кому.Очистить();
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаУдалитьКопии.
//
Процедура КнопкаУдалитьКопииНажатие(Элемент)
	
	Если ЭлементыФормы.Копии.ТекущиеДанные <> Неопределено Тогда
		Копии.Удалить(ЭлементыФормы.Копии.ТекущиеДанные);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаУдалитьКопииВсе.
//
Процедура КнопкаУдалитьКопииВсеНажатие(Элемент)
	
	ОтветНаВопрос = Вопрос(НСтр("ru='Очистить информацию на закладке ""Копии"" ?';uk='Очистити інформацію на закладці ""Копії"" ?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветНаВопрос <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Копии.Очистить();
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаУдалитьСкрытыеКопии.
//
Процедура КнопкаУдалитьСкрытыеКопииНажатие(Элемент)
	
	Если ЭлементыФормы.СкрытыеКопии.ТекущиеДанные <> Неопределено Тогда
		СкрытыеКопии.Удалить(ЭлементыФормы.СкрытыеКопии.ТекущиеДанные);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаУдалитьСкрытыеКопииВсе.
//
Процедура КнопкаУдалитьСкрытыеКопииВсеНажатие(Элемент)
	
	ОтветНаВопрос = Вопрос(НСтр("ru='Очистить информацию на закладке ""Скрытые копии"" ?';uk='Очистити інформацію на закладці ""Приховані копії"" ?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветНаВопрос <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СкрытыеКопии.Очистить();
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаУдалитьОбъекты.
//
Процедура КнопкаУдалитьОбъектыНажатие(Элемент)
	
	Если ЭлементыФормы.Объекты.ТекущиеДанные <> Неопределено Тогда
		Объекты.Удалить(ЭлементыФормы.Объекты.ТекущиеДанные);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаУдалитьОбъектыВсе.
//
Процедура КнопкаУдалитьОбъектыВсеНажатие(Элемент)
	
	
	ОтветНаВопрос = Вопрос(НСтр("ru='Очистить информацию на закладке ""Объекты"" ?';uk='Очистити інформацію на закладці ""Об''єкти"" ?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветНаВопрос <> КодВозвратаДиалога.Да  Тогда
		Возврат;
	КонецЕсли;
	
	Объекты.Очистить();
	
КонецПроцедуры

// Обработчик события ПриИзменении элемента формы СтрокаПоиска.
//
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Объект_НайтиНажатие(Элемент, РезультатыПоиска, Элемент.Значение);
	
КонецПроцедуры

// Обработчик события ПриАктивизацииСтроки элемента формы ГруппыРассылкиСписок.
//
Процедура ГруппыРассылкиСписокПриАктивизацииСтроки(Элемент)
	
	Объект_ГруппыРассылкиСписокПриАктивизацииСтроки(Элемент, СоставГруппыРассылки);
	
КонецПроцедуры

// Обработчик события ПриАктивизацииСтроки элемента формы СоставГруппыРассылки.
//
Процедура СоставГруппыРассылкиПриАктивизацииСтроки(Элемент)
    
    ПодключитьОбработчикОжидания("ОбработчикОжиданияСоставГруппыРассылкиПриАктивизацииСтроки", 0.1, Истина);	 	
	
КонецПроцедуры

// Процедура - обрабочик ожидания для события ПриАктивизацииСтроки
// табличного поля СоставГруппыРассылки
//
Процедура ОбработчикОжиданияСоставГруппыРассылкиПриАктивизацииСтроки()
	ПолучитьАдресЭлектроннойПочты(ЭлементыФормы.СоставГруппыРассылки, ЭлементыФормы.АдресЭлементГруппыРассылки, СписокДанныхТекущейСтрокиДополнительно, "ОбъектРассылки"); 
КонецПроцедуры // ОбработчикОжиданияСоставГруппыРассылкиПриАктивизацииСтроки

 
// Обработчик события Выбор элемента формы СоставГруппыРассылки.
//
Процедура СоставГруппыРассылкиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если НЕ (Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.ОбъектРассылки.ЭтоГруппа) Тогда
		СтандартнаяОбработка = Ложь;
		ДобавитьЭлементыГруппыРассылки(ЭлементыФормы, Элемент, СписокДанныхТекущейСтрокиДополнительно, ЭлементыФормы.АдресЭлементГруппыРассылки);
		ОбработкаВыбораТабличныхПолей(ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события ПередНачаломИзменения элемента формы СоставГруппыРассылки.
//
Процедура СоставГруппыРассылкиПередНачаломИзменения(Элемент, Отказ)
	
	Объект_СоставГруппыРассылкиПередНачаломИзменения(Элемент, Отказ);
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьЭлементГруппыОбъектовВсе.
//
Процедура КнопкаДобавитьЭлементГруппыОбъектовВсеНажатие(Элемент)
	
	ДобавитьЭлементыГруппРассылки(ЭлементыФормы, ГруппыРассылкиСписок);
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы КнопкаДобавитьЭлементГруппыОбъектов.
//
Процедура КнопкаДобавитьЭлементГруппыОбъектовНажатие(Элемент)
	
	ДобавитьЭлементыГруппыРассылки(ЭлементыФормы, ЭлементыФормы.СоставГруппыРассылки, СписокДанныхТекущейСтрокиДополнительно, ЭлементыФормы.АдресЭлементГруппыРассылки);
	
КонецПроцедуры

Процедура КнопкаНайтиНажатие(Элемент)
	
	Объект_НайтиНажатие(Элемент, РезультатыПоиска, СтрокаПоиска);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыЭкспортИмпорт(Кнопка)
	
	Обработки.ЭкспортИмпортКонтактныхДанныхОбъектов.ПолучитьФорму().Открыть();
	
КонецПроцедуры

// Обработчик события Выбор элемента формы Кому.
//
Процедура КомуВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбраннаяСтрока.Объект) Тогда
		СтандартнаяОбработка = Ложь;
		АктивизироватьОбъект(ВыбраннаяСтрока.Объект);
	КонецЕсли;
КонецПроцедуры

// Обработчик события Выбор элемента формы Копии.
//
Процедура КопииВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбраннаяСтрока.Объект) Тогда
		СтандартнаяОбработка = Ложь;
		АктивизироватьОбъект(ВыбраннаяСтрока.Объект);
	КонецЕсли;
КонецПроцедуры

// Обработчик события Выбор элемента формы СкрытыеКопии.
//
Процедура СкрытыеКопииВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбраннаяСтрока.Объект) Тогда
		СтандартнаяОбработка = Ложь;
		АктивизироватьОбъект(ВыбраннаяСтрока.Объект);
	КонецЕсли;
КонецПроцедуры

// Обработчик события Выбор элемента формы Объекты.
//
Процедура ОбъектыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбраннаяСтрока.Объект) Тогда
		СтандартнаяОбработка = Ложь;
		АктивизироватьОбъект(ВыбраннаяСтрока.Объект);
	КонецЕсли;
КонецПроцедуры
